const common = ['1 開運の供物 (NEO) 27', '1 蛾乗りの巡回兵 (NEO) 30', '1 執政の権限 (NEO) 32', '1 道照らし (NEO) 24', '1 永岩城の模範 (NEO) 10', '1 啓蒙の時代 (NEO) 11', '1 狐の腕利き (NEO) 22', '1 神憑く相棒 (NEO) 38', '1 祖先の刀 (NEO) 1', '1 放浪者の介入 (NEO) 41', '1 金之尾の門弟 (NEO) 15', '1 皇国の鎮圧者 (NEO) 19', '1 仲裁者の拘束 (NEO) 20', '1 蜻蛉鎧機 (NEO) 9', '1 蛾との親睦 (NEO) 4', '1 七ツ尾の導師 (NEO) 36', '1 穢れの一掃 (NEO) 33', '1 陽刃の侍 (NEO) 39', '1 皇国の契り (NEO) 17', '1 ネットワークの攪乱者 (NEO) 71', '1 月罠の試作品 (NEO) 69', '1 呪文貫き (NEO) 80', '1 記憶の宝球 (NEO) 64', '1 月回路のハッカー (NEO) 67', '1 次元切開 (NEO) 72', '1 小手の使い魔 (NEO) 46', '1 短絡 (NEO) 78', '1 当世 (NEO) 66', '1 攪乱プロトコル (NEO) 51', '1 ムーンフォークの謎掛け師 (NEO) 68', '1 装身 (NEO) 81', '1 朧宮の守り (NEO) 56', '1 タミヨウの完成化 (NEO) 83', '1 空泳ぎの鯉 (NEO) 79', '1 月罠の専門家 (NEO) 70', '1 未来派の歩哨 (NEO) 54', '1 サイバの侵入者 (NEO) 77', '1 鏡殻のカニ (NEO) 63', '1 お前はもう死んでいる (NEO) 129', '1 大牙勢団の襲撃 (NEO) 117', '1 鷲掴む苦悩 (NEO) 91', '1 ウイルスの甲虫 (NEO) 128', '1 勢団の取り引き (NEO) 120', '1 戦闘復帰 (NEO) 121', '1 致命的な不具合 (NEO) 107', '1 墨昇の潜入者 (NEO) 100', '1 魁渡の追跡 (NEO) 103', '1 祝福刃の鼠 (NEO) 115', '1 神への債務 (NEO) 92', '1 勢団の揺さぶり (NEO) 119', '1 地下街のたかり屋 (NEO) 126', '1 百節棍のムカデ (NEO) 90', '1 ねじれた抱擁 (NEO) 125', '1 恐るべき秘密の神 (NEO) 105', '1 無孤勢団の伏兵 (NEO) 112', '1 眠らぬ影の神 (NEO) 104', '1 毒血勢団の影歩き (NEO) 94', '1 悪忌の戦化粧 (NEO) 132', '1 猿人のスリング (NEO) 163', '1 火をつける怒り (NEO) 151', '1 実験統合機 (NEO) 138', '1 電圧のうねり (NEO) 171', '1 悪忌の種火守り (NEO) 130', '1 悪忌の浪人 (NEO) 131', '1 火花舞う出現 (NEO) 136', '1 神の火炎 (NEO) 150', '1 都和市の整歌師 (NEO) 167', '1 爆発的登場 (NEO) 139', '1 止められぬ大峨 (NEO) 169', '1 無双の侍 (NEO) 156', '1 野心的な突撃 (NEO) 133', '1 屑鉄場の鉄殴り (NEO) 160', '1 憤怒の贈り物 (NEO) 143', '1 勤勉の神 (NEO) 149', '1 戦乱時代 (NEO) 162', '1 鉄蹄の猪 (NEO) 148', '1 しげ樹の牙 (NEO) 183', '1 タミヨウの保管 (NEO) 211', '1 精霊との融和 (NEO) 180', '1 とぐろ巻きの忍び寄り (NEO) 179', '1 樹海の練習生 (NEO) 196', '1 達人の咎め (NEO) 202', '1 竹林の射手 (NEO) 173', '1 記憶の担い 手 (NEO) 174', '1 古の牙を継ぐ者 (NEO) 191', '1 古代への衰退 (NEO) 182', '1 更生の季節 (NEO) 205', '1 入念な栽培 (NEO) 178', '1 融合する成長 (NEO) 188', '1 樹海の好意 (NEO) 184', '1 樹海の 保護者 (NEO) 195', '1 地熱の神 (NEO) 186', '1 調和した出現 (NEO) 190', '1 せし郎師匠の伝承 (NEO) 210', '1 大狸 (NEO) 189', '1 平穏な入り江 (NEO) 280', '1 磨かれたやせ地 (NEO) 274', '1 陰鬱 な僻地 (NEO) 267', '1 急流の崖 (NEO) 277', '1 血溜まりの洞窟 (NEO) 264', '1 ジャングルのうろ穴 (NEO) 269', '1 岩だらけの高地 (NEO) 273', '1 風に削られた岩山 (NEO) 282', '1 花咲く砂地 (NEO) 265', '1 茨森の滝 (NEO) 279', '1 未知なる安息地 (NEO) 281', '1 鉄の弟子 (NEO) 248', '1 忍者の苦無 (NEO) 252', '1 自動操縦の工匠 (NEO) 239', '1 生態学者のテラリウム (NEO) 246', '1 折り紙細工のおとり (NEO) 253', '1 ネットワーク端末 (NEO) 251', '1 粗暴者の鎧機 (NEO) 241', '1 探照灯の相棒 (NEO) 258', '1 劇作家の人形 (NEO) 244', '1 神社の世話役 (NEO) 259', '1 雷鋼の巨像 (NEO) 261'];
const uncommon=['1 魅知子の真理の支配 (NEO) 29', '1 有能な整備士 (NEO) 16', '1 払拭の斬撃 (NEO) 3', '1 無私の侍 (NEO) 35', '1 君主今田の凋落 (NEO) 12', '1 皇国の修復機 (NEO) 18', '1 詩人、山崎典華 (NEO) 31', '1 乗り手の生まれ (NEO) 6', '1 刃吹雪の狐 (NEO) 5', '1 精霊界との接触 (NEO) 40', '1 共同目的の御神体 (NEO) 14', '1 幼き日々 (NEO) 43', '1 空に祝福されし侍 (NEO) 37', '1 逸失叡智の御神体 (NEO) 55', '1 駆動メカ (NEO) 65', '1 本質の把捉 (NEO) 52', '1 思慮深い達人 (NEO) 49', '1 収得のタコ (NEO) 44', '1 知識の渇望 (NEO) 85', '1 不可能の発見 (NEO) 50', '1 裕福な盗人 (NEO) 73', '1 現実への係留 (NEO) 45', '1 未来派の調査員 (NEO) 53', '1 語られざるものの警告 (NEO) 48', '1 複製の専門家 (NEO) 76', '1 現実の強奪 (NEO) 75', '1 覚醒した知覚 (NEO) 47', '1 波止場の料理人 (NEO) 93', '1 うろつく鼠 (NEO) 116', '1 ヒルの篭手 (NEO) 106', '1 毒血勢団の口封じ (NEO) 95', '1 梅澤俊郎の生涯 (NEO) 108', '1 悪意ある機能不全 (NEO) 110', '1 慈悲無き者 (NEO) 127', '1 超力 刃 (NEO) 96', '1 墓照らし (NEO) 98', '1 暗殺者の色墨 (NEO) 87', '1 隠避残虐の御神体 (NEO) 97', '1 夜の長い陰 (NEO) 109', '1 大牙勢団の回収 (NEO) 118', '1 熊野と渇苛斬の対峙 (NEO) 152', '1  増員された浪人 (NEO) 158', '1 兎電池 (NEO) 157', '1 孤独な鍛錬 (NEO) 165', '1 霜剣山の製錬者 (NEO) 164', '1 蜂起軍の無法者 (NEO) 170', '1 龍火花の反応炉 (NEO) 137', '1 古伝戦争の御神体 (NEO) 144', '1 青銅鎧の猪 (NEO) 135', '1 地震波 (NEO) 161', '1 将軍、山崎兵子 (NEO) 146', '1 双弾の狙撃手 (NEO) 168', '1 炎の排出 (NEO) 142', '1 気前のいい訪問者 (NEO) 185', '1 梓の幾多の旅 (NEO) 172', '1 機械壊しの河童 (NEO) 198', '1 大蛇の統合守り (NEO) 203', '1 母聖樹の加護 (NEO) 176', '1 無尽活力の御神体 (NEO) 187', '1 咆哮する大地 (NEO) 204', '1 物語編み (NEO) 209', '1 網紡 ぎの袖飾り (NEO) 214', '1 歴史家の知恵 (NEO) 192', '1 天空に到る母聖樹 (NEO) 177', '1 花咲く跳獣 (NEO) 175', '1 旋輪脚 (NEO) 207', '1 神童の試作機 (NEO) 231', '1 秩序の柱、直美 (NEO) 229', '1 銀毛の達人 (NEO) 236', '1 熱心なメカ乗り (NEO) 218', '1 鬼流の金床 (NEO) 230', '1 闇叫び (NEO) 219', '1 活力の温泉 (NEO) 223', '1 浅利の隊長 (NEO) 215', '1 樹海の自然主義者 (NEO) 225', '1 巨大な空亀 (NEO) 216', '1 メカ格納庫 (NEO) 270', '1 閑静な中庭 (NEO) 275', '1 道路脇の聖遺 (NEO) 272', '1 青銅の棍棒 (NEO) 240', '1 隔離用構築物 (NEO) 243', '1 継ぎ接ぎ自動機械 (NEO) 254', '1 高速ホバーバイク (NEO) 247', '1 回路の修理屋 (NEO) 242', '1 暴走ごみ収集ボット (NEO) 257', '1 霊都の歩哨 (NEO) 256', '1 都和市の案内ボット (NEO) 262', '1 歩行する摩天楼 (NEO) 263'];
const rare=['1 皇国の地、永岩城 (NEO) 268', '1 皇の声、軽脚 (NEO) 25', '1 獅子の飾緒 (NEO) 26', '1 雲鋼の麒麟 (NEO) 8', '1 永岩城の修繕 (NEO) 34', '1 神河の魂、香醍 (NEO) 23', '1 報復招来 (NEO) 21', '1 告別 (NEO) 13', '1 目覚ましい修復術 (NEO) 7', '1 冥途灯りの行進 (NEO) 28', '1 天上都市、大田原 (NEO) 271', '1 千の顔の影 (NEO) 86', '1 現実チップ (NEO) 74', '1 現実の設計者、タメシ (NEO) 82', '1 精神連繋メカ (NEO) 62', '1 発明的反復 (NEO) 57', '1 嵐風招来 (NEO) 58', '1 渦巻く霧の行進 (NEO) 61', '1 見捨てられたぬかるみ、竹沼 (NEO) 278', '1 無孤勢団の霊裂機 (NEO) 113', '1 崩 老卑への貢納 (NEO) 124', '1 カエル乗り、達成 (NEO) 123', '1 噛掌の忍者 (NEO) 88', '1 魂転移 (NEO) 122', '1 貪る混沌、碑出告 (NEO) 99', '1 絶望招来 (NEO) 101', '1 不憫な悲哀の行進 (NEO) 111', '1 反逆のるつぼ、霜剣山 (NEO) 276', '1 大峨頭の兜 (NEO) 155', '1 流星の信奉者、ゴロゴロ (NEO) 145', '1 蜥蜴丸 (NEO) 153', '1 鏡割りの寓話 (NEO) 141', '1 屑鉄の溶接者 (NEO) 159', '1 轟く雷獣 (NEO) 166', '1 災厄招来 (NEO) 147', '1 無謀なる歓喜の行進 (NEO) 154', '1 樹海の幻想家、しげ樹 (NEO) 206', '1 耐え抜くもの、母聖樹 (NEO) 266', '1 調和の織り手 (NEO) 213', '1 無常の神 (NEO) 197', '1 麒麟の教え (NEO) 212', '1 龍の神の再誕 (NEO) 181', '1 古霊招来 (NEO) 193', '1 春葉の報復者 (NEO) 208', '1 芽吹く生命の行進 (NEO) 201', '1 大牙勢団の総長、脂牙 (NEO) 220', '1 梅澤悟 (NEO) 234', '1 沈黙の蜘蛛、琴瀬 (NEO) 228', '1 浅利の司令官、理想那 (NEO) 233', '1 嵐の切先、雷遊 (NEO) 232', '1 永岩城の蜂起 (NEO) 217', '1 生ける伝承、佐津樹 (NEO) 235', '1 二天一流、 一心 (NEO) 224', '1 暁冠の日向 (NEO) 222', '1 長所食い (NEO) 245', '1 メカ巨神のコア (NEO) 249', '1 勢団の銀行破り (NEO) 255', '1 鏡の箱 (NEO) 250', '1 電圧改竄メカ (NEO) 260']
const mythicrare=['1 夜明けの空、猗旺 (NEO) 2', '1 放浪皇 (NEO) 42', '1 肉体の裏切者、テゼレット (NEO) 84', '1 渦巻く空、開璃 (NEO) 60', '1 発展の暴君、ジン＝ギタクシアス (NEO) 59', '1 鬼の刃 (NEO) 89', '1 月の賢者の養子、ナシ (NEO) 114', '1 真夜中の空、殉至 (NEO) 102', '1 燃え立つ空、軋賜 (NEO) 134', '1 爆発的特異性 (NEO) 140', '1 珠眼の寺守り (NEO) 194', '1 西の樹の木霊 (NEO) 199', '1 果て 無き空、空羅 (NEO) 200', '1 精霊の姉の召集 (NEO) 237', '1 漆月魁渡 (NEO) 226', '1 碑出告が全てを貪る (NEO) 221', '1 完成化した賢者、タミヨウ (NEO) 238', '1 神の乱 (NEO) 227']
const hokan=[]

window.onload = function() {
    var table = document.createElement('table'); // 表示用の表作成
    var head = document.createElement('tr');
    ["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14"].forEach(element => {
        var th = document.createElement('th');
        th.textContent = element;
        head.appendChild(th);
    })
    table.appendChild(head);

    for (var i = 0; i < 6; i++) {
        var tr = document.createElement('tr'); // 行の作成
        var th = document.createElement('th');
        th.textContent = i + 1 + 'パック目';
        tr.appendChild(th);

        const rorm = ["m", "r"];
        const w    = [10, 64];
        const sum  = w.reduce(function(sum, element){
            return sum + element;
        }, 0);
        var x = Math.floor(Math.random() * sum);
        const r = ((x) => {
            if (x <= w[0] ) {
                return rorm[0];
            } else {
                return rorm[1];
            }
        })(x);

        // コモン10枚, アンコモン3枚, レア1枚でデッキを作成
        for ( var j = 0; j < 10; j++ ) {
            var th = document.createElement('th');
            th.textContent = common[Math.floor(Math.random() * common.length)];
            tr.appendChild(th);
        }
        for ( var j = 0; j < 3; j++ ) {
            var th = document.createElement('th');
            th.textContent = uncommon[Math.floor(Math.random() * uncommon.length)];
            tr.appendChild(th);
        }
        var th = document.createElement('th');
        if ( r === rorm[0] ) {
            th.textContent = rare[Math.floor(Math.random() * rare.length)];
        } else {
            th.textContent = mythicrare[Math.floor(Math.random() * mythicrare.length)];
        }
        tr.appendChild(th);
        table.appendChild(tr);
    }
    document.getElementById('maintable').appendChild(table);
}
